package plus.easydo.dnf.util;

/**
 * @author laoyu
 * @version 1.0
 * @description 字典
 * @date 2023/10/14
 */

public class DictUtil {

    private DictUtil() {
    }

    public static final String JOB_DICT = """
            {
              "0": {
                "0": "鬼剑士",
                "1": "剑魂",
                "2": "鬼泣",
                "3": "狂战士",
                "4": "阿修罗",
                "5": "征服者"
              },
              "1": {
                "0": "格斗家",
                "1": "气功师",
                "2": "散打",
                "3": "街霸",
                "4": "柔道家",
                "5": "格斗家"
              },
              "2": {
                "0": "神枪手",
                "1": "漫游枪手",
                "2": "枪炮师",
                "3": "机械师",
                "4": "弹药专家",
                "5": "神枪手"
              },
              "3": {
                "0": "魔法师",
                "1": "元素师",
                "2": "召唤师",
                "3": "战斗法师",
                "4": "魔道學者",
                "5": "魔法师"
              },
              "4": {
                "0": "圣职者",
                "1": "圣骑士",
                "2": "蓝拳圣使",
                "3": "驱魔師",
                "4": "复仇者",
                "5": "金刚力士"
              },
              "5": {
                "0": "神枪手",
                "1": "漫游枪手",
                "2": "枪炮师",
                "3": "机械师",
                "4": "弹药专家",
                "5": "神槍手"
              },
              "6": {
                "0": "暗夜使者",
                "1": "刺客",
                "2": "死灵术士",
                "3": "忍者",
                "4": "影武者",
                "5": "暗夜使者"
              },
              "7": {
                "0": "格斗家",
                "1": "气功师",
                "2": "散打",
                "3": "街霸",
                "4": "柔道家",
                "5": "格斗家"
              },
              "8": {
                "0": "魔法师",
                "1": "元素爆破师",
                "2": "冰结师",
                "3": "战斗法师",
                "4": "魔道学者",
                "5": "魔法師"
              },
              "9": {
                "0": "黑暗武士",
                "1": "剑魂",
                "2": "鬼泣",
                "3": "狂战士",
                "4": "阿修罗",
                "5": "征服者"
              },
              "10": {
                "0": "夜皇",
                "1": "驭剑士",
                "2": "流浪武士",
                "3": "契魔者",
                "4": "暗殿骑士",
                "5": "魔法师"
              }
            }""";
}
